{
  "<PAD>": 0,
  "I-restriction_code": 1,
  "B-arrive_time.time": 2,
  "B-depart_date.date_relative": 3,
  "I-return_date.day_number": 4,
  "B-fromloc.state_code": 5,
  "B-depart_time.period_of_day": 6,
  "B-depart_time.period_mod": 7,
  "I-flight_stop": 8,
  "I-time": 9,
  "B-depart_date.year": 10,
  "I-airline_name": 11,
  "B-flight_days": 12,
  "I-arrive_time.period_of_day": 13,
  "B-return_date.day_name": 14,
  "B-toloc.state_name": 15,
  "B-flight_time": 16,
  "B-restriction_code": 17,
  "B-connect": 18,
  "B-days_code": 19,
  "B-fromloc.state_name": 20,
  "I-depart_time.time": 21,
  "B-flight_mod": 22,
  "I-arrive_time.time": 23,
  "B-toloc.country_name": 24,
  "B-meal": 25,
  "B-return_time.period_of_day": 26,
  "I-return_date.date_relative": 27,
  "B-or": 28,
  "B-return_date.today_relative": 29,
  "I-depart_time.time_relative": 30,
  "I-class_type": 31,
  "I-arrive_time.start_time": 32,
  "B-transport_type": 33,
  "B-depart_time.time": 34,
  "I-meal_code": 35,
  "B-fare_basis_code": 36,
  "I-depart_time.end_time": 37,
  "B-arrive_time.time_relative": 38,
  "I-fromloc.state_name": 39,
  "B-meal_description": 40,
  "I-airport_name": 41,
  "I-arrive_time.end_time": 42,
  "B-state_code": 43,
  "I-toloc.city_name": 44,
  "B-airline_name": 45,
  "B-depart_date.today_relative": 46,
  "B-arrive_date.day_name": 47,
  "B-toloc.airport_name": 48,
  "B-airport_code": 49,
  "I-cost_relative": 50,
  "I-depart_date.day_number": 51,
  "B-stoploc.state_code": 52,
  "B-depart_time.time_relative": 53,
  "B-return_date.day_number": 54,
  "B-flight_stop": 55,
  "B-city_name": 56,
  "B-depart_date.day_name": 57,
  "I-depart_time.start_time": 58,
  "I-transport_type": 59,
  "B-fromloc.city_name": 60,
  "B-arrive_time.start_time": 61,
  "B-arrive_date.today_relative": 62,
  "B-economy": 63,
  "B-mod": 64,
  "B-month_name": 65,
  "B-fromloc.airport_name": 66,
  "B-today_relative": 67,
  "B-arrive_time.period_of_day": 68,
  "I-toloc.state_name": 69,
  "B-toloc.airport_code": 70,
  "B-fare_amount": 71,
  "B-toloc.state_code": 72,
  "I-fromloc.city_name": 73,
  "B-depart_time.start_time": 74,
  "B-flight_number": 75,
  "B-meal_code": 76,
  "B-round_trip": 77,
  "B-toloc.city_name": 78,
  "I-arrive_date.day_number": 79,
  "B-day_name": 80,
  "B-state_name": 81,
  "I-arrive_time.time_relative": 82,
  "I-meal_description": 83,
  "B-airline_code": 84,
  "I-depart_time.period_of_day": 85,
  "I-stoploc.city_name": 86,
  "B-return_time.period_mod": 87,
  "B-arrive_date.day_number": 88,
  "B-aircraft_code": 89,
  "B-class_type": 90,
  "I-flight_time": 91,
  "O": 92,
  "B-arrive_time.end_time": 93,
  "B-day_number": 94,
  "B-arrive_date.month_name": 95,
  "B-stoploc.city_name": 96,
  "I-fromloc.airport_name": 97,
  "I-economy": 98,
  "B-airport_name": 99,
  "I-toloc.airport_name": 100,
  "I-flight_mod": 101,
  "B-depart_date.day_number": 102,
  "B-fromloc.airport_code": 103,
  "B-stoploc.airport_name": 104,
  "I-fare_amount": 105,
  "B-return_date.date_relative": 106,
  "I-return_date.today_relative": 107,
  "I-fare_basis_code": 108,
  "B-arrive_time.period_mod": 109,
  "I-round_trip": 110,
  "B-cost_relative": 111,
  "B-time": 112,
  "B-time_relative": 113,
  "B-arrive_date.date_relative": 114,
  "I-today_relative": 115,
  "B-period_of_day": 116,
  "B-return_date.month_name": 117,
  "B-depart_time.end_time": 118,
  "I-city_name": 119,
  "I-depart_date.today_relative": 120,
  "B-depart_date.month_name": 121,
  "I-state_name": 122,
  "I-flight_number": 123,
  "B-compartment": 124,
  "B-flight": 125,
  "B-stoploc.airport_code": 126,
  "B-booking_class": 127,
  "[CLS]": 128,
  "[SEP]":129
}