{
  "<PAD>": 0,
  "<UNK>": 1,
  "i": 2,
  "want": 3,
  "to": 4,
  "fly": 5,
  "from": 6,
  "boston": 7,
  "at": 8,
  "838": 9,
  "am": 10,
  "and": 11,
  "arrive": 12,
  "in": 13,
  "denver": 14,
  "1110": 15,
  "the": 16,
  "morning": 17,
  "what": 18,
  "flight": 19,
  "are": 20,
  "available": 21,
  "pittsburgh": 22,
  "baltimore": 23,
  "on": 24,
  "thursday": 25,
  "is": 26,
  "arrival": 27,
  "time": 28,
  "san": 29,
  "francisco": 30,
  "for": 31,
  "755": 32,
  "leaving": 33,
  "washington": 34,
  "cheapest": 35,
  "airfare": 36,
  "tacoma": 37,
  "orlando": 38,
  "round": 39,
  "trip": 40,
  "fare": 41,
  "philadelphia": 42,
  "under": 43,
  "1000": 44,
  "dollar": 45,
  "need": 46,
  "a": 47,
  "tomorrow": 48,
  "columbus": 49,
  "minneapolis": 50,
  "kind": 51,
  "of": 52,
  "aircraft": 53,
  "used": 54,
  "cleveland": 55,
  "dallas": 56,
  "show": 57,
  "me": 58,
  "los": 59,
  "angeles": 60,
  "all": 61,
  "ground": 62,
  "transportation": 63,
  "diego": 64,
  "newark": 65,
  "by": 66,
  "way": 67,
  "houston": 68,
  "airport": 69,
  "bwi": 70,
  "after": 71,
  "6": 72,
  "pm": 73,
  "first": 74,
  "class": 75,
  "before": 76,
  "7": 77,
  "information": 78,
  "tuesday": 79,
  "please": 80,
  "give": 81,
  "next": 82,
  "week": 83,
  "would": 84,
  "like": 85,
  "united": 86,
  "airline": 87,
  "list": 88,
  "plane": 89,
  "american": 90,
  "have": 91,
  "some": 92,
  "ticket": 93,
  "atlanta": 94,
  "book": 95,
  "which": 96,
  "serf": 97,
  "wednesday": 98,
  "leave": 99,
  "2": 100,
  "o": 101,
  "also": 102,
  "service": 103,
  "arriving": 104,
  "noon": 105,
  "new": 106,
  "york": 107,
  "milwaukee": 108,
  "northwest": 109,
  "departing": 110,
  "720": 111,
  "miami": 112,
  "find": 113,
  "delta": 114,
  "number": 115,
  "with": 116,
  "st": 117,
  "louis": 118,
  "burbank": 119,
  "sunday": 120,
  "evening": 121,
  "arrange": 122,
  "between": 123,
  "8": 124,
  "friday": 125,
  "how": 126,
  "far": 127,
  "it": 128,
  "indianapolis": 129,
  "florida": 130,
  "twenty": 131,
  "seventh": 132,
  "eighth": 133,
  "december": 134,
  "ha": 135,
  "most": 136,
  "serve": 137,
  "code": 138,
  "h": 139,
  "fort": 140,
  "worth": 141,
  "both": 142,
  "direct": 143,
  "connecting": 144,
  "that": 145,
  "charlotte": 146,
  "today": 147,
  "you": 148,
  "going": 149,
  "july": 150,
  "go": 151,
  "much": 152,
  "doe": 153,
  "limousine": 154,
  "cost": 155,
  "within": 156,
  "u": 157,
  "air": 158,
  "any": 159,
  "out": 160,
  "booking": 161,
  "c": 162,
  "know": 163,
  "shortest": 164,
  "see": 165,
  "12": 166,
  "monday": 167,
  "least": 168,
  "expensive": 169,
  "returning": 170,
  "may": 171,
  "could": 172,
  "tell": 173,
  "toronto": 174,
  "do": 175,
  "city": 176,
  "proper": 177,
  "latest": 178,
  "meal": 179,
  "make": 180,
  "reservation": 181,
  "this": 182,
  "coming": 183,
  "q": 184,
  "mean": 185,
  "dc": 186,
  "seattle": 187,
  "salt": 188,
  "lake": 189,
  "earliest": 190,
  "snack": 191,
  "type": 192,
  "beginning": 193,
  "april": 194,
  "fifth": 195,
  "sixth": 196,
  "august": 197,
  "ninth": 198,
  "back": 199,
  "into": 200,
  "general": 201,
  "mitchell": 202,
  "international": 203,
  "oakland": 204,
  "saturday": 205,
  "twa": 206,
  "display": 207,
  "travel": 208,
  "early": 209,
  "now": 210,
  "jose": 211,
  "fourth": 212,
  "depart": 213,
  "nonstop": 214,
  "4": 215,
  "distance": 216,
  "many": 217,
  "there": 218,
  "being": 219,
  "served": 220,
  "where": 221,
  "canadian": 222,
  "midnight": 223,
  "stop": 224,
  "stopping": 225,
  "mco": 226,
  "rent": 227,
  "car": 228,
  "phoenix": 229,
  "cincinnati": 230,
  "serving": 231,
  "dinner": 232,
  "long": 233,
  "beach": 234,
  "stopover": 235,
  "last": 236,
  "love": 237,
  "field": 238,
  "5": 239,
  "november": 240,
  "flying": 241,
  "smallest": 242,
  "america": 243,
  "west": 244,
  "or": 245,
  "southwest": 246,
  "kansa": 247,
  "two": 248,
  "june": 249,
  "eleventh": 250,
  "petersburg": 251,
  "then": 252,
  "thank": 253,
  "tenth": 254,
  "one": 255,
  "329": 256,
  "okay": 257,
  "get": 258,
  "afternoon": 259,
  "la": 260,
  "vega": 261,
  "march": 262,
  "second": 263,
  "no": 264,
  "night": 265,
  "can": 266,
  "economy": 267,
  "sixteenth": 268,
  "qw": 269,
  "coach": 270,
  "rate": 271,
  "memphis": 272,
  "september": 273,
  "leaf": 274,
  "352": 275,
  "area": 276,
  "sure": 277,
  "don": 278,
  "only": 279,
  "during": 280,
  "10": 281,
  "offer": 282,
  "serviced": 283,
  "downtown": 284,
  "midwest": 285,
  "express": 286,
  "nineteenth": 287,
  "around": 288,
  "230": 289,
  "chicago": 290,
  "arrives": 291,
  "cheap": 292,
  "thrift": 293,
  "return": 294,
  "rental": 295,
  "1024": 296,
  "tampa": 297,
  "take": 298,
  "continental": 299,
  "le": 300,
  "than": 301,
  "100": 302,
  "seating": 303,
  "capacity": 304,
  "fourteenth": 305,
  "thirty": 306,
  "fifteenth": 307,
  "daily": 308,
  "such": 309,
  "abbreviation": 310,
  "f": 311,
  "eastern": 312,
  "logan": 313,
  "nashville": 314,
  "sorry": 315,
  "wanted": 316,
  "guardia": 317,
  "schedule": 318,
  "thirtieth": 319,
  "1": 320,
  "852": 321,
  "jersey": 322,
  "ohio": 323,
  "paul": 324,
  "westchester": 325,
  "county": 326,
  "approximately": 327,
  "615": 328,
  "detroit": 329,
  "heading": 330,
  "9": 331,
  "via": 332,
  "an": 333,
  "say": 334,
  "about": 335,
  "mealtime": 336,
  "1991": 337,
  "interested": 338,
  "provides": 339,
  "business": 340,
  "prefer": 341,
  "listing": 342,
  "530": 343,
  "1288": 344,
  "lunch": 345,
  "same": 346,
  "day": 347,
  "wish": 348,
  "third": 349,
  "stand": 350,
  "twelfth": 351,
  "difference": 352,
  "should": 353,
  "be": 354,
  "close": 355,
  "price": 356,
  "four": 357,
  "257": 358,
  "twentieth": 359,
  "boeing": 360,
  "737": 361,
  "across": 362,
  "continent": 363,
  "sfo": 364,
  "again": 365,
  "430": 366,
  "seventeenth": 367,
  "f28": 368,
  "looking": 369,
  "minnesota": 370,
  "layover": 371,
  "630": 372,
  "overnight": 373,
  "their": 374,
  "highest": 375,
  "trying": 376,
  "connection": 377,
  "those": 378,
  "breakfast": 379,
  "yes": 380,
  "if": 381,
  "airplane": 382,
  "yn": 383,
  "seat": 384,
  "1700": 385,
  "ord": 386,
  "813": 387,
  "using": 388,
  "local": 389,
  "2134": 390,
  "nationair": 391,
  "qx": 392,
  "montreal": 393,
  "maximum": 394,
  "colorado": 395,
  "pennsylvania": 396,
  "my": 397,
  "choice": 398,
  "lowest": 399,
  "through": 400,
  "route": 401,
  "dl": 402,
  "746": 403,
  "transport": 404,
  "ontario": 405,
  "represented": 406,
  "database": 407,
  "trans": 408,
  "world": 409,
  "1030": 410,
  "1130": 411,
  "discount": 412,
  "hi": 413,
  "tower": 414,
  "either": 415,
  "1765": 416,
  "2153": 417,
  "will": 418,
  "soon": 419,
  "thereafter": 420,
  "possible": 421,
  "eight": 422,
  "sixteen": 423,
  "jfk": 424,
  "late": 425,
  "restriction": 426,
  "ap": 427,
  "57": 428,
  "71": 429,
  "up": 430,
  "466": 431,
  "eighteenth": 432,
  "each": 433,
  "supper": 434,
  "3": 435,
  "bna": 436,
  "106": 437,
  "1100": 438,
  "11": 439,
  "departure": 440,
  "explain": 441,
  "80": 442,
  "passenger": 443,
  "fit": 444,
  "d9s": 445,
  "arrangement": 446,
  "your": 447,
  "starting": 448,
  "afterwards": 449,
  "dfw": 450,
  "345": 451,
  "october": 452,
  "19": 453,
  "y": 454,
  "hello": 455,
  "provided": 456,
  "other": 457,
  "north": 458,
  "carolina": 459,
  "but": 460,
  "quebec": 461,
  "california": 462,
  "canada": 463,
  "originate": 464,
  "82": 465,
  "139": 466,
  "repeating": 467,
  "420": 468,
  "let": 469,
  "look": 470,
  "ua": 471,
  "281": 472,
  "m80": 473,
  "1115": 474,
  "1245": 475,
  "m": 476,
  "sa": 477,
  "land": 478,
  "regarding": 479,
  "january": 480,
  "name": 481,
  "takeoff": 482,
  "landing": 483,
  "later": 484,
  "72s": 485,
  "fn": 486,
  "hp": 487,
  "cp": 488,
  "us": 489,
  "seven": 490,
  "carry": 491,
  "qo": 492,
  "co": 493,
  "416": 494,
  "so": 495,
  "here": 496,
  "1992": 497,
  "weekday": 498,
  "kindly": 499,
  "taxi": 500,
  "825": 501,
  "when": 502,
  "555": 503,
  "201": 504,
  "place": 505,
  "includes": 506,
  "help": 507,
  "1026": 508,
  "124": 509,
  "lufthansa": 510,
  "fifteen": 511,
  "plan": 512,
  "six": 513,
  "oh": 514,
  "define": 515,
  "live": 516,
  "ff": 517,
  "year": 518,
  "total": 519,
  "connect": 520,
  "ea": 521,
  "747": 522,
  "including": 523,
  "718": 524,
  "use": 525,
  "philly": 526,
  "815": 527,
  "928": 528,
  "located": 529,
  "bur": 530,
  "ap57": 531,
  "dinnertime": 532,
  "traveling": 533,
  "315": 534,
  "1291": 535,
  "following": 536,
  "1039": 537,
  "lastest": 538,
  "longest": 539,
  "amount": 540,
  "21": 541,
  "1222": 542,
  "over": 543,
  "200": 544,
  "they": 545,
  "just": 546,
  "must": 547,
  "2100": 548,
  "operation": 549,
  "d": 550,
  "s": 551,
  "297": 552,
  "question": 553,
  "more": 554,
  "texas": 555,
  "nw": 556,
  "laying": 557,
  "limo": 558,
  "650": 559,
  "tonight": 560,
  "ewr": 561,
  "3724": 562,
  "l": 563,
  "describe": 564,
  "originating": 565,
  "210": 566,
  "stapleton": 567,
  "who": 568,
  "making": 569,
  "343": 570,
  "1600": 571,
  "hour": 572,
  "option": 573,
  "noontime": 574,
  "ten": 575,
  "people": 576,
  "1145": 577,
  "inform": 578,
  "k": 579,
  "932": 580,
  "near": 581,
  "aa": 582,
  "459": 583,
  "tennessee": 584,
  "calling": 585,
  "designate": 586,
  "without": 587,
  "spend": 588,
  "hou": 589,
  "1220": 590,
  "directly": 591,
  "reverse": 592,
  "b": 593,
  "belong": 594,
  "445": 595,
  "515": 596,
  "midway": 597,
  "217": 598,
  "sometime": 599,
  "150": 600,
  "dc10": 601,
  "110": 602,
  "connects": 603,
  "charge": 604,
  "minimum": 605,
  "intercontinental": 606,
  "bound": 607,
  "727": 608,
  "final": 609,
  "destination": 610,
  "different": 611,
  "296": 612,
  "324": 613,
  "823": 614,
  "1059": 615,
  "271": 616,
  "alaska": 617,
  "934": 618,
  "michigan": 619,
  "able": 620,
  "put": 621,
  "locate": 622,
  "hartfield": 623,
  "scheduled": 624,
  "train": 625,
  "225": 626,
  "1158": 627,
  "equipment": 628,
  "begin": 629,
  "reach": 630,
  "carried": 631,
  "these": 632,
  "indiana": 633,
  "well": 634,
  "try": 635,
  "right": 636,
  "130": 637,
  "arizona": 638,
  "continuing": 639,
  "include": 640,
  "lester": 641,
  "pearson": 642,
  "along": 643,
  "friend": 644,
  "everywhere": 645,
  "thirteenth": 646,
  "transcontinental": 647,
  "73s": 648,
  "whether": 649,
  "offered": 650,
  "we": 651,
  "missouri": 652,
  "utah": 653,
  "another": 654,
  "usa": 655,
  "red": 656,
  "eye": 657,
  "1045": 658,
  "georgia": 659,
  "dulles": 660,
  "currently": 661,
  "anywhere": 662,
  "visit": 663,
  "them": 664,
  "life": 665,
  "55": 666,
  "determine": 667,
  "thing": 668,
  "705": 669,
  "catch": 670,
  "straight": 671,
  "767": 672,
  "269": 673,
  "planning": 674,
  "listed": 675,
  "1055": 676,
  "405": 677,
  "departs": 678,
  "equal": 679,
  "ac": 680,
  "provide": 681,
  "hopefully": 682,
  "turboprop": 683,
  "symbol": 684,
  "sort": 685,
  "cover": 686,
  "810": 687,
  "operating": 688,
  "february": 689,
  "1205": 690,
  "757": 691,
  "270": 692,
  "733": 693,
  "atl": 694,
  "requesting": 695,
  "meaning": 696,
  "besides": 697,
  "too": 698,
  "month": 699,
  "got": 700,
  "somebody": 701,
  "else": 702,
  "level": 703,
  "vicinity": 704,
  "taking": 705,
  "311": 706,
  "mia": 707,
  "instead": 708,
  "repeat": 709,
  "eleven": 710,
  "off": 711,
  "415": 712,
  "greatest": 713,
  "summer": 714,
  "300": 715,
  "lax": 716,
  "economic": 717,
  "bay": 718,
  "402": 719,
  "845": 720,
  "j31": 721,
  "date": 722,
  "1020": 723,
  "730": 724,
  "400": 725,
  "doesn": 726,
  "1993": 727,
  "toward": 728,
  "home": 729,
  "1850": 730,
  "1505": 731,
  "run": 732,
  "723": 733,
  "thanks": 734,
  "bring": 735,
  "zone": 736,
  "yyz": 737,
  "non": 738,
  "buy": 739,
  "500": 740,
  "come": 741,
  "428": 742,
  "98": 743,
  "qualify": 744,
  "279": 745,
  "137338": 746,
  "d10": 747,
  "539": 748,
  "fine": 749,
  "while": 750,
  "1200": 751,
  "ap80": 752,
  "concerning": 753,
  "iah": 754,
  "1230": 755,
  "still": 756,
  "preferably": 757,
  "itinerary": 758,
  "3357": 759,
  "323": 760,
  "229": 761,
  "inexpensive": 762,
  "actually": 763,
  "734": 764,
  "earlier": 765,
  "1017": 766,
  "1083": 767,
  "0900": 768,
  "645": 769,
  "single": 770,
  "ap68": 771,
  "4400": 772,
  "1133": 773,
  "43": 774,
  "once": 775,
  "town": 776,
  "various": 777,
  "212": 778,
  "reaching": 779,
  "305": 780,
  "anything": 781,
  "771": 782,
  "very": 783,
  "jet": 784,
  "nevada": 785,
  "staying": 786,
  "order": 787,
  "497766": 788,
  "sound": 789,
  "great": 790,
  "three": 791,
  "start": 792,
  "1500": 793,
  "hold": 794,
  "1209": 795,
  "sd": 796,
  "1300": 797,
  "enroute": 798,
  "advertises": 799,
  "having": 800,
  "seventeen": 801,
  "company": 802,
  "1940": 803,
  "priced": 804,
  "closest": 805,
  "largest": 806,
  "oak": 807,
  "twelve": 808,
  "505": 809,
  "163": 810,
  "nighttime": 811,
  "819": 812,
  "417": 813,
  "working": 814,
  "scenario": 815,
  "811": 816,
  "665": 817,
  "673": 818,
  "608": 819,
  "1207": 820,
  "639": 821,
  "320": 822,
  "dh8": 823,
  "sb": 824,
  "468": 825,
  "al": 826,
  "950": 827,
  "486": 828,
  "india": 829,
  "included": 830,
  "mile": 831,
  "l10": 832,
  "be1": 833,
  "bn": 834,
  "wn": 835,
  "1994": 836,
  "382": 837,
  "20": 838,
  "phl": 839,
  "mci": 840,
  "not": 841,
  "l1011": 842,
  "dc9": 843,
  "dca": 844,
  "1800": 845,
  "good": 846,
  "dtw": 847,
  "prior": 848,
  "tpa": 849,
  "kw": 850,
  "bh": 851,
  "yx": 852,
  "ap58": 853,
  "sam": 854,
  "basis": 855,
  "combination": 856,
  "1201": 857,
  "kennedy": 858,
  "ever": 859,
  "called": 860,
  "842": 861,
  "cvg": 862,
  "lga": 863,
  "419": 864,
  "exceeding": 865
}